# однострочный комментарий
'''
Многострочный
комментарий
'''
'''
    Пример работы с целыми числами
'''
a = 25
b=9
z=3
y=5
print("z = ", z)
print("y = ", y)
print("z + y = ", z + y) # сложение чисел
print("z - y = ", z - y) # вычитание чисел
print("z * y = ", z * y) # умножение чисел
print("z / y = ", z / y) # деление чисел
print("z // y = ", z // y) # деление с округлением вниз до целого
print("z % y = ", z % y) # остаток от деления print("a ** b = ", a ** b) # возведение в степень
print("z ** y = ", z ** y) # возведение в степень
# приведение типа int к float
a1 = float(a)
print("a1 = ",a1)
print("\n")
'''
    Пример работы с вещественными числами
'''
c = 3.5
d = 6.9
print("c = ", c)
print("d = ", d)
print("c + d = ", c + d) # сложение чисел
print("c * d = ", c * d) # умножение чисел
print("c / d = ", c / d) # деление чисел
d1 = 2.3e-5
print("d1 = ",d1)
print("c + d1 = ", c + d1) # сложение чисел
# приведение типа float к int
d2 = int(d)
print("d2 = ",d2)
5
print("\n")
'''
    Операторы присваивания
'''
e = 7
print("e = 7: ", e)
e += 3
print("e += 3: ", e)
e -= 3
print("e -= 3: ", e)
e *= 15
print("e *= 5: ", e)
e /= 4
print("e /= 4: ", e)
e //= 2
print("e //= 2: ", e)
e %= 5
print("e %= 5: ", e)
e **= 3
print("e **= 3: ", e)
print("\n")

x = 105
v = 58
print('x/v: ', x/v)
print('float(x/v): ',float(x/v))